<h1>陣列的宣告</h1>
<hr>

<p>$a=array();</p>
<p>print_r($a);</p>
<p>var_dump($a);</p>

<?php

$a=array();
$b=[];

echo "print_r";
print_r($a);
echo "<br>";
echo "var_dump=";
var_dump($a);
echo "<br>";

?>

<hr>
<h1>陣列宣告並給值</h1>
<hr>
<p>$a=[1,2,3];</p>
<p>$a[]=1;</p>
<p>$a[]=2;</p>
<p>$a[]=3;</p>

<?php
$a=[1,2,3];
print_r($a);
echo "<br>";
$b[]=1;
$b[]=2;
$b[]=3;
print_r($b);
echo "<br>";
$AA=["a","b","c"];
print_r($AA);
echo "<br>";
$c['A01']="張大同";
$c['A02']="王曉明";
$c['B07']="趙自強";
print_r($c);

?>

<h1>陣列的使用</h1>
<hr>
<?php

echo $a[1];
$a[1]=123321;
echo "<br>";
echo $a[1];
echo "<br>";
echo $c['B07'];
echo "<br>";

$judy=[95,64,70,90,84];
$amo=[88,78,54,81,71];
$john=[45,60,68,70,62];
$peter=[59,32,77,54,42];
$hebe=[71,62,80,62,64];

$judy=["國文"=>95,"英文"=>64,"數學"=>70,"地理"=>90,"歷史"=>84];

$score=["judy"=>["國文"=>95,"英文"=>64,"數學"=>70,"地理"=>90,"歷史"=>84],
      "amo"=>["國文"=>88,"英文"=>78,"數學"=>54,"地理"=>81,"歷史"=>71],
      "john"=>["國文"=>65,"英文"=>60,"數學"=>68,"地理"=>70,"歷史"=>62],
      "peter"=>["國文"=>59,"英文"=>32,"數學"=>77,"地理"=>54,"歷史"=>42],
      "hebe"=>["國文"=>65,"英文"=>71,"數學"=>80,"地理"=>62,"歷史"=>64]];
print_r($score['amo']['英文']);
      


$score=[["name"=>"judy","score"=>["國文"=>95,"英文"=>64,"數學"=>70,"地理"=>90,"歷史"=>84]],
        ["name"=>"amo","score"=>["國文"=>88,"英文"=>78,"數學"=>54,"地理"=>81,"歷史"=>71]],
        ["name"=>"john","score"=>["國文"=>65,"英文"=>60,"數學"=>68,"地理"=>70,"歷史"=>62]],
        ["name"=>"peter","score"=>["國文"=>59,"英文"=>32,"數學"=>77,"地理"=>54,"歷史"=>42]],
        ["name"=>"hebe","score"=>["國文"=>65,"英文"=>71,"數學"=>80,"地理"=>62,"歷史"=>64]]];

?>
